In [1]:
import pandas as pd

In [2]:
# 1-1
dict_data = {'a' : 1, 'b':2, 'c' : 3}
sr = pd.Series(dict_data)
print(type(sr))
print(sr)
display(sr)
print(sr.shape)

<class 'pandas.core.series.Series'>
a    1
b    2
c    3
dtype: int64

a    1
b    2
c    3
dtype: int64

(3,)

In [3]:
# 1-2
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
print(sr)
idx = sr.index
print(idx)
val = sr.values
print(val)
print(sr.dtype)
print(len(sr))
print(sr.shape)
print(sr.ndim)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object
RangeIndex(start=0, stop=5, step=1)
['2019-01-02' 3.14 'ABC' 100 True]
object
5
(5,)
1

In [4]:
# 1- 3
tup_data = ('영인', '2019-01-02','여',True)
sr = pd.Series(tup_data, index=['이름','생년월일','성별','학생여부'])
print(sr)
print('-----------------------')
print(sr[0])
print(sr['이름'])
print(sr[[1,2]])
print(sr.loc[['생년월일','성별']])
print(sr[1:2])
print(sr['생년월일':'성별'])
pd.Series(5)
pd.Series(5, index=["a", "b", "c"])

이름              영인
생년월일    2019-01-02
성별               여
학생여부          True
dtype: object
-----------------------
영인
영인
생년월일    2019-01-02
성별               여
dtype: object
생년월일    2019-01-02
성별               여
dtype: object
생년월일    2019-01-02
dtype: object
생년월일    2019-01-02
성별               여
dtype: object

C:\Users\lsj03\AppData\Local\Temp\ipykernel_33780\957557995.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[0])
C:\Users\lsj03\AppData\Local\Temp\ipykernel_33780\957557995.py:8: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[[1,2]])

a    5
b    5
c    5
dtype: int64

In [5]:
# 1-4
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data)
print(type(df))
print(df)
display(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [6]:
# 1-5
df = pd.DataFrame( [ [15, '남', '덕영중'],
                     [17, '여', '수리중'] ],
                     index=['준서', '예은'],
                     columns=['나이', '성별', '학교'] )
print(df)
print(df.index)
print(df.columns)
df.index=(['학생','학생2'])
df.columns=(['연령', '남녀','소속'])
print(df)
print(df.index)
print(df.columns)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')
     연령 남녀   소속
학생   15  남  덕영중
학생2  17  여  수리중
Index(['학생', '학생2'], dtype='object')
Index(['연령', '남녀', '소속'], dtype='object')

In [7]:
# 1-6
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95], '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data, index = ['서준','우현','인아'])
display(df)

df1 =df.copy()
df1 = df1.drop('우현')
display(df1)

df2 = df.copy()
df2 = df2.drop(['우현', '인아'], axis = 0)
display(df2)

df3 = df.copy()
df3 = df3.drop(['우현', '인아'], axis = 'index')
display(df3)

df4 = df.copy()
df4 = df4.drop(index = '우현')
display(df4)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

    수학  영어  음악   체육
서준  90  98  85  100

    수학  영어  음악   체육
서준  90  98  85  100

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [8]:
# 1-8
display(df)

df2 = df.copy()
df2 = df2.drop('수학', axis = 1)
display(df2)

df3 = df.copy()
df3 = df3.drop(['수학','영어'], axis = 'columns')
display(df3)

df4 = df.copy()
df4 = df4.drop(columns='체육')
display(df4)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

     음악   체육
서준   85  100
우현   95   90
인아  100   90

    수학  영어   음악
서준  90  98   85
우현  80  89   95
인아  70  95  100

In [9]:
# 1- 9

display(df)
label1 = df.loc['서준']
display(label1)
label2 = df.iloc[0]
display(label2)
label3 = df.loc[['서준', '우현']]
display(label3)
position = df.iloc[[0,1]]
display(position)
position1 = df.iloc[:3:2]
display(position1)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [10]:
# 1-10
exam_data = {'이름' : ['서준','우현','인아'],
             '수학' : [ 90, 80, 70], 
             '영어' : [ 98, 89, 95], 
             '음악' : [ 85, 95, 100], 
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
display(df)

math = df['수학']
display(math)

english = df.영어
display(english)

m_g = df[['체육','음악']]
print(m_g)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

0    90
1    80
2    70
Name: 수학, dtype: int64

0    98
1    89
2    95
Name: 영어, dtype: int64

    체육   음악
0  100   85
1   90   95
2   90  100

In [11]:
# 1 - 11
display(df)
df1 = df.set_index('이름')
display(df1)
a = df1.loc['서준', '음악']
display(a)
b = df1.iloc[0,2]
print(b)
c = df1.loc['서준', ['음악','체육']]
display(c)
d= df1.iloc[0,2:]
display(d)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

np.int64(85)

85

음악     85
체육    100
Name: 서준, dtype: int64

음악     85
체육    100
Name: 서준, dtype: int64

In [12]:
# 1-12
display(df)
df1 = df.copy()
df1['국어'] = 80
display(df1)
df1['미술'] = 80,90,100
display(df1)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

   이름  수학  영어   음악   체육  국어   미술
0  서준  90  98   85  100  80   80
1  우현  80  89   95   90  80   90
2  인아  70  95  100   90  80  100

In [13]:
# 1-13
display(df)
df.loc[3] = 0
display(df)
df.loc[4] = ['동규', 0, 1, 2, 3]
display(df)
df.loc['행'] = df.loc[3]
display(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규   0   1    2    3

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규   0   1    2    3
행   0   0   0    0    0

In [14]:
# 1-14
exam_data = {'이름' : ['서준','우현','인아'],
             '수학' : [ 90, 80, 70], 
             '영어' : [ 98, 89, 95], 
             '음악' : [ 85, 95, 100], 
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
display(df)
df = df.set_index('이름')
display(df)
df.iloc[0][3] = 80
display(df)
df.loc['서준', '체육'] = 77
display(df)
df.loc['서준',['음악', '체육']] = 20 ,10
display(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

C:\Users\lsj03\AppData\Local\Temp\ipykernel_33780\3319413756.py:11: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0][3] = 80
C:\Users\lsj03\AppData\Local\Temp\ipykernel_33780\3319413756.py:11: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.iloc[0][3] = 80

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

    수학  영어   음악  체육
이름
서준  90  98   85  77
우현  80  89   95  90
인아  70  95  100  90

    수학  영어   음악  체육
이름
서준  90  98   20  10
우현  80  89   95  90
인아  70  95  100  90

In [15]:
# 1-15
exam_data = {'이름' : ['서준','우현','인아'],
             '수학' : [ 90, 80, 70], 
             '영어' : [ 98, 89, 95], 
             '음악' : [ 85, 95, 100], 
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
display(df)

df=df.transpose()
display(df)

df=df.T
display(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [16]:
# 1-16

df = pd.DataFrame(exam_data)
display(df)

ndf = df.set_index(['이름'])
display(ndf)

ndf2 = df.set_index('음악')
display(ndf2)
ndf3 = df.set_index(['음악','수학'])
display(ndf3)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

     이름  수학  영어   체육
음악
85   서준  90  98  100
95   우현  80  89   90
100  인아  70  95   90

        이름  영어   체육
음악  수학
85  90  서준  98  100
95  80  우현  89   90
100 70  인아  95   90

In [17]:
# 1 -17
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[13,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data, index=['r0','r1','r2'])
display(df)
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index, fill_value=0)
display(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  13  13
r1   2   5   8  11  14
r2   3   6   9  12  15

    c0  c1  c2  c3  c4
r0   1   4   7  13  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [18]:
# 1-18
display(df)
ndf1= df.reset_index()
display(ndf1)

    c0  c1  c2  c3  c4
r0   1   4   7  13  13
r1   2   5   8  11  14
r2   3   6   9  12  15

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  13  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [19]:
# 1-19
display(df)
ndf = df.sort_index(ascending=False)
display(ndf)
ndf = df.sort_index(ascending=True)
display(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  13  13
r1   2   5   8  11  14
r2   3   6   9  12  15

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  13  13

    c0  c1  c2  c3  c4
r0   1   4   7  13  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [20]:
# 1-20
display(df)
ndf = df.sort_values(by = 'c3',ascending=False)
display(ndf)
ndf = df.sort_values(by = ['c1','c3'],ascending=True)
display(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  13  13
r1   2   5   8  11  14
r2   3   6   9  12  15

    c0  c1  c2  c3  c4
r0   1   4   7  13  13
r2   3   6   9  12  15
r1   2   5   8  11  14

    c0  c1  c2  c3  c4
r0   1   4   7  13  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [21]:
# 1-21
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
print(student1)
p = student1/200
print(p)

국어    100
영어     80
수학     90
dtype: int64
국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [22]:
# 1-22
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
a= student1 + student2
b = student1 - student2
print(a)
print(b)
result = pd.DataFrame([a,b], index=['덧셈', '뺼셈'])
print(result)

국어    190
수학    170
영어    160
dtype: int64
국어    10
수학    10
영어     0
dtype: int64
     국어   수학   영어
덧셈  190  170  160
뺼셈   10   10    0

In [23]:
# 1- 23
import numpy as np
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})
print(student1)
print(student2)

addition = student1 + student2               
subtraction = student1 - student2            
multiplication = student1 * student2         
division = student1 / student2               
print(type(division))

result = pd.DataFrame( [addition, subtraction, multiplication, division], 
                        index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

국어     NaN
영어    80.0
수학    90.0
dtype: float64
수학    80
국어    90
dtype: int64
<class 'pandas.core.series.Series'>
     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [24]:
# 1 - 24
sr_add = student1.add(student2,fill_value=0)
sr_sub = student1.sub(student2,fill_value=0)
sr_mul = student1.mul(student2,fill_value=0)
sr_div = student1.div(student2,fill_value=0)

result = pd.DataFrame( [sr_add, sr_sub, sr_mul, sr_div], 
                        index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

In [25]:
# 1-25
import seaborn as sns
titanic = sns.load_dateset('titanic')
df = titanic.loc[:,['age','fare']]
print(df.head())
print(type(df))

addition = df + 10
print(addition.head())
print(type(addition))

ModuleNotFoundError: No module named 'seaborn'

In [ ]:
# 1 - 26
titanic = sns.load_dateset('titanic')
df = titanic.loc[:,['age','fare']]
print(df.tail())
print(type(df))

addition = df + 10
print(addition.tail())
print(type(addition))

subtraction = addition - df
print(subtraction.tail())
print(type(subtraction))

sample1 = addition.tail()
sample2 = subtraction.tail().fillna(0.0)

print(sample1)
print(sample2)

df_add = sample1.add(sample2, fill_value=0)
df_sub = sample1.sub(sample2, fill_value=0)
df_mul = sample1.mul(sample2, fill_value=0)
df_div = sample1.div(sample2, fill_value=0)

NameError: name 'sns' is not defined